//нижче [userType] - це синтаксис для доступу до властивості об'єкта за допомогою змінної. У цьому випадку, якщо userType дорівнює "admin", то user[userType] буде еквівалентно user["admin"], що дозволяє нам динамічно додавати властивість до об'єкта user на основі значення змінної userType. Це корисно, коли ми хочемо визначити тип користувача і надати йому відповідні права доступу або функціональність в залежності від його ролі.

/*let userType = "user";// це змінна, яка містить рядок "user". Вона використовується для визначення типу користувача, який може бути "admin", "manager" або "user". Ця змінна може бути використана для перевірки прав доступу користувача до певних функцій або ресурсів в програмі. Наприклад, якщо userType дорівнює "admin", то користувач може мати доступ до адміністративних функцій, тоді як якщо userType дорівнює "user", то користувач може мати обмежений доступ до певних функцій або ресурсів.
let roles = ["admin", "manager", "user"];// це масив, який містить рядки "admin", "manager" та "user". Він використовується для зберігання можливих типів користувачів, які можуть бути присвоєні змінній userType. Цей масив може бути використаний для перевірки, чи є значення userType допустимим типом користувача, або для надання різних прав доступу в залежності від типу користувача. Наприклад, якщо userType дорівнює "admin", то користувач може мати доступ до адміністративних функцій, тоді як якщо userType дорівнює "user", то користувач може мати обмежений доступ до певних функцій або ресурсів.

let user = {
  name: "John",
  age: 30,
  city: "New York",
  credentials: {
    login: "Test",
  },
};

if (roles.includes(userType)) {// це умова, яка перевіряє, чи містить масив roles значення userType. Метод includes() використовується для перевірки наявності елемента в масиві. Якщо userType є одним з елементів масиву roles (наприклад, "admin", "manager" або "user"), то умова буде істинною і код всередині блоку if буде виконаний. Якщо userType не є одним з елементів масиву roles, то умова буде хибною і код всередині блоку if не буде виконаний.
  user[userType] = true;// це рядок коду, який додає нову властивість до об'єкта user з ім'ям, яке відповідає значенню змінної userType, і присвоює їй значення true. Наприклад, якщо userType дорівнює "admin", то цей рядок коду додасть властивість admin до об'єкта user і встановить її значення в true. Це може бути використано для позначення ролі користувача або для надання йому певних прав доступу в програмі.
}
console.log(user[userType]); // виведе "admin"

*/

//GETTER для чого потрібен

//1. щоб обєднати кілька властивостей об'єкта в одну. Наприклад, якщо у нас є об'єкт користувача з властивостями ім'я та прізвище, ми можемо створити геттер для повного імені, який буде обчислюватися на основі цих двох властивостей.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",

  get fullName() {
    return `${this.name} ${this.sName}`;
  },
};

console.log(user.fullName); // виведе "Iryna Marchuk"
console.log(user);
*/

//2. Відформатувати значення. Наприклад, якщо у нас є об'єкт користувача з властивістю номер телефону, ми можемо створити геттер для повного номера телефону, який буде обчислюватися на основі коду країни та самого номера.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  phone: "7246771",

  get PhoneNumber() {
    return 68 + this.phone;
  },
};
console.log(user.PhoneNumber); // виведе 0687246771
*/

//3. Обчислити значення на основі інших властивостей. Наприклад, якщо у нас є об'єкт користувача з властивістю дата народження, ми можемо створити геттер для віку, який буде обчислюватися на основі поточного року та року народження.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  birthday: 1997,

  get Age() {
    return 2026 - this.birthday;
  },
};
console.log(user.Age); // виведе 29
*/

//4.Щоб обмежити доступ до певних властивостей об'єкта. Наприклад, якщо у нас є об'єкт користувача з властивістю пароль, ми можемо створити геттер для перевірки правильності пароля, який буде порівнювати введений пароль з збереженим паролем і повертати true або false.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  password: "123456",

  get isPasswordCorrect() {
    return function (inputPassword) {
      return inputPassword === this.password;
    };
  },
};
console.log(user.isPasswordCorrect("3456")); // виведе false
console.log(user);
*/

//5. Щоб створити віртуальні властивості, які не зберігаються в об'єкті, але можуть бути обчислені на основі інших властивостей. Наприклад, якщо у нас є об'єкт користувача з властивістю дата народження, ми можемо створити геттер для знаку зодіаку, який буде обчислюватися на основі дати народження.

/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  birthday: "1997-01-29",
  get ZodiacSign() {
    const date = new Date(this.birthday); // створюємо об'єкт Date на основі рядка з датою народження користувача. Це дозволяє нам легко отримати день та місяць з цієї дати для подальших обчислень.
    // new Date(this.birthday) створює новий об'єкт Date, використовуючи рядок this.birthday як аргумент. Рядок повинен бути у форматі, який розуміє конструктор Date, наприклад "YYYY-MM-DD". У цьому випадку, якщо this.birthday дорівнює "1997-01-29", то new Date(this.birthday) створить об'єкт Date, який представляє 29 січня 1997 року. Потім ми можемо використовувати методи getDate() та getMonth() цього об'єкта для отримання дня та місяця відповідно.
    const day = date.getDate(); // отримуємо день з об'єкта Date за допомогою методу getDate(). Це повертає число від 1 до 31, яке представляє день місяця.
    const month = date.getMonth() + 1;
    if ((month === 1 && day >= 20) || (month === 2 && day <= 18)) {
      return "Водолій";
    } else if ((month === 2 && day >= 19) || (month === 3 && day <= 20)) {
      return "Риби";
    }

    return "Невідомий знак зодіаку";
  },
};
console.log(user.ZodiacSign); // виведе "Водолій"
*/

//6.  Сховати внутрішню структуру об'єкта. Якщо програмісти звертаються до властивості name, а завтра програміст змінить структуру об'єкта і замість name буде firstName, то код який звертається до властивості name зламається. Але якщо ми створимо геттер для FullName, то ми можемо змінити внутрішню структуру об'єкта, не змінюючи код який звертається до властивості FullName. Тоді user.name буде працювати

/*let user = {
  Firstname: "Iryna",
  sName: "Marchuk",
  password: "123456",

  get name() {
    return `${this.Firstname} ${this.sName}`;
  },
};
console.log(user.name); // і програмісти навіть не помітять що ми змінили структуру об'єкта, тому що вони звертаються до властивості name, а не до Firstname і sName
*/
