"number" + 3 + 3;
("number33"); // конкатинація

null + 3;
3; // null приводиться до 0

5 && "qwerty";
("qwerty"); // оператор && повертає  останнє true значення

+"40" + +"2" + "hillel";
("42hillel"); // унарний плюс перетворює рядок в число,потім додавання, а потім  конкатинація

"10" - 5 === 6;
false; //  тому що "-" приводить значення до числа, 10 - 5 = 5, а не 6

true + false;
1; // true приводиться до 1, а false до 0, тому 1 + 0 = 1

"4px" - 3;
NaN; // "4px" не може бути перетворено в число, тому результатом буде NaN

"4" - 3;
1; // "4" приводиться до числа 4, тому 4 - 3 = 1

"6" + 3 ** 0;
("61"); // 3 ** 0 = 1, а "6" у нас записано стрінгою, тому "6" + 1 = "61"конкатинація

12 / "6";
2; // при діленні "6" приводиться до числа 6, тому 12 / 6 = 2

"10" + (5 === 6);
("10false"); // 5 === 6 повертає false, тому "10" + false = "10false" конкатинація

null == "";
false; // null не рівний порожньому рядку

3 ** (9 / 3);
27; // спочатку виконується дія в дужках, 9 / 3 = 3, потім 3 ** 3 = 27

!!"false" == !!"true";
true; // обидва рядки є непорожніми, а оператор !! приводить до булевого значення, тому !!"false" і !!"true" обидва повертають true

0 || ("0" && 1);
1; // оператор && має вищий пріоритет, тому спочатку виконується "0" && 1, що повертає 1, а потім 0 || 1 повертає 1

(+null == false) < 1;
false; // +null приводиться до 0, тому 0 == false повертає true, а true < 1 повертає false тому що true приводиться до 1

(false && true) || true;
true; // оператор && має вищий пріоритет, тому спочатку виконується false && true, що повертає false, а потім false || true повертає true

false && (false || true);
false; // оператор || в дужках має вищий пріоритет, тому спочатку виконується false || true, що повертає true, а потім false && true повертає falseБ тому що оператору && немає сенсу іти далі якщо перше значення вже false

(+null == false) < 1 ** 5;
false; // +null приводиться до 0, тому 0 == false повертає true, а 1 ** 5 = 1, тому true < 1 повертає false
