//SETTER

// setter - це спеціальний метод об'єкта, який дозволяє встановлювати значення властивості. Він викликається, коли ми намагаємося присвоїти значення властивості об'єкта
//тут ми обмежуємо можливість змінювати ім'я користувача після його встановлення. Якщо ми спробуємо змінити ім'я, setter виведе повідомлення про заборону зміни і залишить ім'я незмінним. Таким чином, ми забезпечуємо захист від небажаних змін і зберігаємо цілісність даних об'єкта.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  birthday: 1997,

  get herName() {
    // геттер для отримання імені користувача. Він повертає значення властивості name, яке містить ім'я користувача. Коли ми звертаємося до user.herName, геттер виконується і повертає нам ім'я користувача.
    return this.name;
  },

  set herName(newName) {
    // setter для встановлення імені користувача. Він перевіряє, чи нове ім'я відрізняється від поточного, і виводить повідомлення про заборону зміни, якщо це так.
    if (newName === this.name) {
      //
      return;
    }
    console.log(`Зміна заборонена. Ім'я вже встановлено як ${this.name}.`);
  },
};
user.herName = "Ivan"; // виведе "Зміна заборонена. Ім'я вже встановлено як Iryna."
//console.log(user.herName); // виведе "Iryna";
*/

// 1. Валідація даних
// Щоб виконувати додаткову логіку при встановленні значення. Наприклад, якщо у нас є об'єкт користувача з властивістю вік, ми можемо створити сеттер для віку, який буде перевіряти, чи введене значення є дійсним числом і не менше 0, перш ніж встановити його.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  birthday: 1997,
  age: 26,

  get Age() {
    return this.age;
  },
  set Age(newAge) {
    if (typeof newAge !== "number" || newAge < 0) {
      // перевіряємо, чи новий вік є числом і не менше 0. Якщо це не так, виводимо повідомлення про недійсне значення і не змінюємо вік.
      console.log("Недійсне значення віку. Введіть додатне число.");
      return;
    }
    this.age = newAge;
  },
};
user.Age = "jcnsjkd"; // виведе "Недійсне значення віку. Введіть додатне число."
console.log(user.Age); // виведе 26, оскільки вік не був змінений через недійсне значен
*/

// 2. Форматування даних
// Щоб автоматично форматувати значення перед його збереженням. Наприклад, якщо у нас є об'єкт користувача з властивістю електронна пошта, ми можемо створити сеттер для електронної пошти, який буде автоматично приводити введену адресу до нижнього регістру перед її збереженням.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  email: "<EMAIL>",

  set Email(newEmail) {
    this.email = newEmail.toLowerCase(); // сеттер для електронної пошти, який приймає нову адресу електронної пошти як аргумент, приводить її до нижнього регістру за допомогою методу toLowerCase() і зберігає відформатовану адресу в властивості email об'єкта.
  },
};
user.Email = "<EMAIL>"; // встановлюємо нову адресу електронної пошти, яка буде автоматично відформатована до нижнього регістру.
console.log(user.email); // виведе "<email>", оскільки сеттер автоматично привів адресу до нижнього регістру перед її збереженням.

*/

// 3. Перетворення типів даних
// Щоб автоматично перетворювати значення до потрібного типу перед його збереженням. Наприклад, якщо у нас є об'єкт користувача з властивістю вік, ми можемо створити сеттер для віку, який буде автоматично перетворювати введене значення до числа перед його збереженням.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  age: 26,
  set Age(newAge) {
    this.age = Number.parseFloat(newAge); // сеттер для віку, який приймає нове значення віку як аргумент, перетворює його до числа за допомогою функції Number() і зберігає перетворене значення в властивості age об'єкта.
  },
};
user.Age = "29 ffdfnkjfk"; // встановлюємо новий вік, який буде автоматично перетворений до числа перед його збереженням.
console.log(user.age); // виведе 30, оскільки сеттер автоматично перетворив введене значення до числа перед його збереженням.
*/

//4. Запуск додаткової логіки

//5. Логування змін
// Щоб відстежувати зміни значень властивостей об'єкта. Наприклад, якщо у нас є об'єкт користувача з властивістю статус, ми можемо створити сеттер для статусу, який буде виводити повідомлення в консоль кожного разу, коли статус змінюється.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  status: "active",
  set Status(newStatus) {
    console.log(`Статус змінено з ${this.status} на ${newStatus}`);
    this.status = newStatus;
  },
};
user.Status = "inactive"; // виведе "Статус змінено з active на inactive"
console.log(user.status); // виведе "inactive"
*/
