//This

/*let account = {
  balance: 3000,

  deposit(amount) {
    this.balance += amount;
  },

  withdraw(amount) {
    this.balance -= amount;
  },

  showBalance() {
    console.log(this.balance); //
  },
};

let friendAccount = {
  balance: 400,
}; // тут ми створюємо нову змінну friendAccount і присвоюємо їй посилання на об'єкт account. Це означає, що friendAccount і account вказують на один і той же об'єкт в пам'яті. Тому, коли ми викликаємо методи deposit або withdraw через friendAccount, вони змінюють баланс в тому ж об'єкті, на який посилається account. Таким чином, зміни, внесені через friendAccount, будуть відображатися при виклику showBalance через account, оскільки обидві змінні посилаються на один і той же об'єкт.

friendAccount.deposit = account.deposit;
friendAccount.withdraw = account.withdraw;
friendAccount.showBalance = account.showBalance;

account.deposit(10000);
//account.withdraw(1000);
account.showBalance(); // виведе 3700
*/

//friendAccount.deposit(5000);
//friendAccount.showBalance(); // виведе 4700, оскільки friendAccount і account посилаються на один і той же об'єкт, тому зміни, внесені через friendAccount, відображаються при виклику showBalance через account.

// тобто This  - це ключове слово, яке вказує на поточний об'єкт, в якому виконується код. У цьому випадку, коли ми викликаємо методи deposit, withdraw або showBalance через friendAccount, this буде посилатися на об'єкт friendAccount. Оскільки friendAccount і account посилаються на один і той же об'єкт, this.balance буде відображати баланс цього об'єкта, який може бути змінений через будь-який з цих методів. Таким чином, this дозволяє нам працювати з властивостями та методами об'єкта, на який посилається змінна, яка викликає ці методи.
/*this.balance це те саме що friendAccount.balance або account.balance, оскільки обидві змінні посилаються на один і той же об'єкт, який має властивість balance. 
Коли ми викликаємо методи deposit, withdraw або showBalance через friendAccount, this буде посилатися на об'єкт friendAccount, і тому this.balance буде відображати баланс цього об'єкта. 
Оскільки friendAccount і account посилаються на один і той же об'єкт, зміни, внесені через будь-який з цих методів, будуть відображаться при виклику showBalance через account, 
оскільки вони працюють з одним і тим же об'єктом в пам'яті.*/

/*
let user = {
  name: "Iryna",
  sName: "Marchuk",
  method() {
    function inner(obj, key) {
      // це звичайна функція, яка приймає два параметри: obj (який буде об'єктом user) і key (який буде рядком "name"). Вона виводить значення властивості obj[key] в консоль. Оскільки this всередині inner не вказує на об'єкт user, а на глобальний об'єкт Window, то obj[key] буде еквівалентно Window["name"], що не існує, тому виведе undefined. Якщо ми хочемо, щоб this всередині inner вказував на об'єкт user, ми можемо використовувати стрілкову функцію або зберегти посилання на this у змінній перед викликом inner.
      console.log(this.name); // НЕПРАВИЛЬНО виведе Window, оскільки this вказує на глобальний об'єкт Window, а не на об'єкт user, оскільки inner є звичайною функцією, а не методом об'єкта user.
      console.log("Hello " + obj[key]); // виведе "Hello Iryna", оскільки obj[key] буде еквівалентно user["name"], що містить рядок "Iryna". Таким чином, коли ми викликаємо inner(this, "name") всередині методу method, this буде посилатися на об'єкт user, і obj[key] буде еквівалентно user["name"], що дозволяє нам отримати значення властивості name і вивести його в консоль.
    }
    inner(this, "name"); // викликаємо функцію inner і передаємо їй this (який вказує на об'єкт user) і рядок "name" (який є ключем для властивості name в об'єкті user). Однак, оскільки inner є звичайною функцією, а не методом об'єкта user, this всередині inner буде вказувати на глобальний об'єкт Window, а не на об'єкт user. Тому, коли ми виконуємо console.log(this) всередині inner, він виведе Window замість user. Якщо ми хочемо, щоб this всередині inner вказував на об'єкт user, ми можемо використовувати стрілкову функцію або зберегти посилання на this у змінній перед викликом inner.
  },
};

user.method(); // викликаємо метод method об'єкта user, який в свою чергу викликає функцію inner. Оскільки inner є звичайною функцією, а не методом об'єкта user, this всередині inner буде вказувати на глобальний об'єкт Window, а не на об'єкт user. Тому, коли ми виконуємо console.log(this) всередині inner, він виведе Window замість user. Якщо ми хочемо, щоб this всередині inner вказував на об'єкт user, ми можемо використовувати стрілкову функцію або зберегти посилання на this у змінній перед викликом inner.
*/

//ЗАФІКСОВАНИЙ КОНТПЕКСТ THIS
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  method() {
    let self = this; // зберігаємо посилання на this у змінній self, щоб ми могли використовувати його всередині функції inner і отримувати доступ до властивостей об'єкта user.

    function inner() {
      console.log(self.name); // виведе "Iryna", оскільки self вказує на об'єкт user, і self.name буде еквівалентно user.name, що містить рядок "Iryna". Таким чином, коли ми викликаємо inner() всередині методу method, self буде посилатися на об'єкт user, і ми зможемо отримати доступ до його властивостей, таких як name, навіть всередині звичайної функції inner.
    }
    inner();
  },
};

user.method(); // викликаємо метод method об'єкта user, який в свою чергу викликає функцію inner. Оскільки ми зберегли посилання на this у змінній self, то всередині inner ми можемо використовувати self для доступу до властивостей об'єкта user. Таким чином, коли ми виконуємо console.log(self.name) всередині inner, він виведе "Iryna", оскільки self.name буде еквівалентно user.name, що містить рядок "Iryna". Це дозволяє нам отримати доступ до властивостей об'єкта user навіть всередині звичайної функції inner, яка не має власного контексту this.
 // виведе undefined, оскільки this в глобальному контексті вказує на глобальний об'єкт Window, і Window не має властивості name. Якщо ми хочемо побачити результат виконання методу method, нам потрібно викликати його, наприклад, user.method(), щоб побачити вивід "Iryna" в консолі.
*/

/////3 Приклади одної і тієї ж задачі з різними методами

//// 1 ОЦЕ НА ПРАКТИЦІ НАЙЧАТСІШЕ ТРАПЛЯЄТЬСЯ
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  birthday: 1997,
};
function getAge(user) {
  console.log(2026 - user.birthday); // виведе 1997, оскільки user.birthday буде еквівалентно user.birthday, що містить число 1997. Таким чином, коли ми викликаємо getAge(user), this всередині getAge буде посилатися на об'єкт user, і ми зможемо отримати доступ до його властивості birthday для обчислення віку.
}
//user.getAge();
getAge(user); // викликаємо функцію getAge і передаємо їй об'єкт user. Оскільки this всередині getAge буде посилатися на об'єкт user, ми зможемо отримати доступ до його властивості birthday для обчислення віку. Таким чином, коли ми виконуємо console.log(user.birthday) всередині getAge, він виведе 1997, оскільки user.birthday буде еквівалентно user.birthday, що містить число 1997. Це дозволяє нам отримати доступ до властивості birthday об'єкта user для подальших обчислень або виводу інформації про вік користувача.
*/

///2  CALL І APPLY - ЦЕ МЕТОДИ ЯКІ ДОЗВОЛЯЮТЬ НАМ ВСТАНОВИТИ КОНТЕКСТ THIS ДЛЯ ФУНКЦІЇ, ЯКЩО ВОНА НЕ Є МЕТОДОМ ОБ'ЄКТА, А ЗВИЧАЙНОЮ ФУНКЦІЄЮ. ВОНИ ДОЗВОЛЯЮТЬ НАМ ВИКОРИСТОВУВАТИ ФУНКЦІЮ З РІЗНИМИ ОБ'ЄКТАМИ, ВСТАНОВЛЮЮЧИ КОНТЕКСТ THIS НА ЦІ ОБ'ЄКТИ ПРИ КОЖНОМУ ВИКЛИКУ.
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  birthday: 1997,
};
function getAge() {
  console.log(2026 - this.birthday); // виведе 1997, оскільки this.birthday буде еквівалентно user.birthday, що містить число 1997. Таким чином, коли ми викликаємо getAge.call(user), this всередині getAge буде посилатися на об'єкт user, і ми зможемо отримати доступ до його властивості birthday для обчислення віку.
}
getAge.call(user); // викликаємо функцію getAge і використовуємо метод call для встановлення контексту this на об'єкт user. Таким чином, коли ми виконуємо console.log(this.birthday) всередині getAge, він виведе 1997, оскільки this.birthday буде еквівалентно user.birthday, що містить число 1997. Це дозволяє нам отримати доступ до властивості birthday об'єкта user для подальших обчислень або виводу інформації про вік користувача.
*/

/////3 ОЦЕ КРУТЕ ТРЕБА ЗАПАМЯТАТИ САМЕ ЛОГІКУ
/*let user = {
  name: "Iryna",
  sName: "Marchuk",
  birthday: 1997,
};
function getAge() {
  console.log(2026 - this.birthday); // виведе 1997, оскільки this.birthday буде еквівалентно user.birthday, що містить число 1997. Таким чином, коли ми викликаємо getAge.apply(user), this всередині getAge буде посилатися на об'єкт user, і ми зможемо отримати доступ до його властивості birthday для обчислення віку.
}
user.newAge = 30; // аналогія проста
user.getAge = getAge; // ми додаємо метод getAge до об'єкта user БУКВАЛЬНО ДОДАЄМО НОВУ ВЛАСТИВІСТЬ
//Тепер в обєкті буде:
// name: 'Iryna',
//sName: 'Marchuk',
//birthday: 1997,
//getAge: [Function: getAge]!!!!!! - НОва властивість
// Це дозволяє нам викликати getAge як метод об'єкта user, і всередині getAge this буде посилатися на об'єкт user, що дозволяє нам отримати доступ до його властивості birthday для обчислення віку.
user.getAge();
console.log(user); //тепер при виклику ми побачимо що у нас є нова властивість getAge, яка є функцією, і коли ми викликаємо user.getAge(), this всередині getAge буде посилатися на об'єкт user, що дозволяє нам отримати доступ до його властивості birthday для обчислення віку. Таким чином, коли ми виконуємо console.log(this.birthday) всередині getAge, він виведе 1997, оскільки this.birthday буде еквівалентно user.birthday, що містить число 1997. Це дозволяє нам отримати доступ до властивості birthday об'єкта user для подальших обчислень або виводу інформації про вік користувача.
*/
